<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"105fbda736bc371bd5fdc5136c4f1bcdad56694dd2cec47864c86589ac4413b5","plan_job_ref":"Job Terraform plan #14 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8124242440","plan_out_hash":"b5c0dfb81de694da404e96c342744a5e62188f3c1fb4edb3035f7dec7d120fcf","plan_hash":"61644226597ef57b2db6a4377a5f497a6864c082d49b7c3be1f6898955912020","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # yandex_storage_bucket.bucket is tainted, so must be replaced
-/+ resource "yandex_storage_bucket" "bucket" {
!~      bucket_domain_name    = "movie-recognizer.storage.yandexcloud.net" -> (known after apply)
!~      default_storage_class = "STANDARD" -> (known after apply)
!~      folder_id             = "********************" -> (known after apply)
!~      id                    = "****************" -> (known after apply)
-       max_size              = 0 -> null
-       tags                  = {} -> null
+       website_domain        = (known after apply)
+       website_endpoint      = (known after apply)
#        (4 unchanged attributes hidden)

-       anonymous_access_flags {
-           config_read = false -> null
-           list        = false -> null
-           read        = false -> null
        }

+       grant {
+           id          = "aje4bqsa9iv6piqm1tmk"
+           permissions = [
+               "READ",
+               "WRITE",
            ]
+           type        = "CanonicalUser"
        }

-       versioning {
-           enabled = false -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform apply #4](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8124247825)